
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Продажи 
	Движения.Продажи.Записывать = Истина;
	Для Каждого ТекСтрокаСписокЧудес Из СписокЧудес Цикл
		Движение = Движения.Продажи.Добавить();
		Движение.Период = Дата;
		Движение.Чудеса = ТекСтрокаСписокЧудес.Чудеса;
		Движение.Количество = ТекСтрокаСписокЧудес.Количество;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
